export const quesList = [
    { title: "你更喜欢在大型社交聚会中与许多人交谈", level: 0 },
    { title: "还是与几个亲密的朋友进行深入交流,当需要做决定时", level: 0 },
    { title: "你更倾向于依靠自己的直觉和感觉", level: 0 },
    {
      title: "还是依靠实际的事实和逻辑,你更倾向于按照计划和时间表进行工作",
      level: 0,
    },
    { title: "还是更喜欢灵活地处理事务和适应变化,在与他人交往时", level: 0 },
    { title: "你更注重逻辑和客观的分析", level: 0 },
    {
      title:
        "还是更关注情感和人际关系,你更喜欢将注意力集中在当前的事实和现实情况上",
      level: 0,
    },
    { title: "还是对未来的可能性和潜在意义感兴趣,当与他人发生冲突时", level: 0 },
    { title: "你倾向于追求和谐解决问题", level: 0 },
    {
      title: "还是坚持自己的观点和原则,你更倾向于通过思考和内省来解决问题",
      level: 0,
    },
    {
      title: "还是通过与他人讨论和交流来得到想法和观点,在工作或学习中",
      level: 0,
    },
    { title: "你更愿意按部就班地完成任务", level: 0 },
    { title: "还是喜欢在最后期限前进行冲刺,当需要做决策时", level: 0 },
    { title: "你更倾向于依靠逻辑和分析", level: 0 },
    {
      title: "还是依据自己的价值观和感受,你更喜欢与他人一起合作完成任务",
      level: 0,
    },
    {
      title: "还是独立工作和处理事务,你更倾向于喜欢有明确规则和结构的工作环境",
      level: 0,
    },
    { title: "还是喜欢更加开放和自由的工作环境,在社交场合中", level: 0 },
    { title: "你更多地表现得外向、健谈和活跃", level: 0 },
    {
      title: "还是内向、沉思和保持独立,你更倾向于根据实际情况和经验来做决策",
      level: 0,
    },
    {
      title: "还是依靠你的直觉和直觉来做决策,你更喜欢预先计划和组织你的日程安排",
      level: 0,
    },
    { title: "还是喜欢根据当天的需求和情况做出调整,在工作中", level: 0 },
    { title: "你更注重完成任务和达到目标", level: 0 },
    {
      title:
        "还是更关注人们的需求和情感,你更倾向于根据你的个人标准和价值观来做决策",
      level: 0,
    },
    {
      title: "还是根据公认的规则和标准,你更愿意通过阅读和研究来获取知识和信息",
      level: 0,
    },
    {
      title: "还是通过与他人交流和互动,你更喜欢在独立和自由的环境中工作",
      level: 0,
    },
    {
      title: "还是在团队合作和合作的环境中工作,你更关注细节和具体事实",
      level: 0,
    },
    {
      title: "还是更喜欢关注整体和大局观,你更倾向于理性和客观地分析问题",
      level: 0,
    },
    { title: "还是更注重情感和个人价值观,", level: 0 },
  ].map((el,i) =>({...el,index:i}));